export const books = ["בראשית", "שמות", "ויקרא", "במדבר", "דברים"];

export const Bible = [
  {
    name: "בראשית",
    chapters: [
      { name: "א", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ב", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ג", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
    ],
  },
  {
    name: "שמות",
    chapters: [
      { name: "א", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ב", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ג", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ד", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
    ],
  },
  {
    name: "ויקרא",
    chapters: [
      { name: "א", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ב", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ג", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ד", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ה", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
    ],
  },
  {
    name: "במדבר",
    chapters: [
      { name: "א", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ב", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
    ],
  },
  {
    name: "דברים",
    chapters: [
      { name: "א", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ב", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ג", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
      { name: "ד", verses: ["א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י"] },
    ],
  },
];
