import gematriya from 'gematriya';

function createChapter(versesCount: number) {
  return {
    verses: Array.from({ length: versesCount }, (_, i) =>
      gematriya(i + 1, { geresh: false, punctuate: false })
    ),
  };
}

function createBook(name: string, chaptersCounts: number[]) {
  return {
    name,
    chapters: chaptersCounts.map(createChapter),
  };
}

export const Bible = [
  createBook(
    'בראשית',
    [
      31, 25, 24, 26, 32, 22, 24, 22, 29, 32, 32, 20, 18, 24, 21, 16, 27, 33,
      38, 18, 34, 24, 20, 67, 34, 35, 46, 22, 35, 43, 55, 32, 20, 31, 29, 43,
      36, 30, 23, 23, 57, 38, 34, 34, 28, 34, 31, 22, 33, 26,
    ]
  ),
  createBook(
    'שמות',
    [
      22, 25, 22, 31, 23, 30, 25, 32, 35, 29, 10, 51, 22, 31, 27, 36, 16, 27,
      25, 26, 36, 31, 33, 18, 40, 37, 21, 43, 46, 38, 18, 35, 23, 35, 35, 38,
      29, 31, 43, 38,
    ]
  ),
  createBook(
    'ויקרא',
    [
      17, 16, 17, 35, 19, 30, 38, 36, 24, 20, 47, 8, 59, 57, 33, 34, 16, 30, 37,
      27, 24, 33, 44, 23, 55, 46, 34,
    ]
  ),
  createBook(
    'במדבר',
    [
      54, 34, 51, 49, 31, 27, 89, 26, 23, 36, 35, 16, 33, 45, 41, 50, 13, 32,
      22, 29, 35, 41, 30, 25, 18, 65, 23, 31, 40, 16, 54, 42, 56, 29, 34, 13,
    ]
  ),
  createBook(
    'דברים',
    [
      46, 37, 29, 49, 33, 25, 26, 20, 29, 22, 32, 32, 18, 29, 23, 22, 20, 22,
      21, 20, 23, 30, 25, 22, 19, 19, 26, 69, 28, 20, 30, 52, 29, 12,
    ]
  ),
];

export const BibleParashot = {
  בראשית: [
    'בראשית',
    'נח',
    'לך לך',
    'וירא',
    'חיי שרה',
    'תולדות',
    'ויצא',
    'וישלח',
    'וישב',
    'מקץ',
    'ויגש',
    'ויחי',
  ],
  שמות: [
    'שמות',
    'וארא',
    'בא',
    'בשלח',
    'יתרו',
    'משפטים',
    'תרומה',
    'תצוה',
    'כי תשא',
    'ויקהל',
    'פקודי',
  ],
  ויקרא: [
    'ויקרא',
    'צו',
    'שמיני',
    'תזריע',
    'מצורע',
    'אחרי מות',
    'קדושים',
    'אמור',
    'בהר',
    'בחוקותי',
  ],
  במדבר: [
    'במדבר',
    'נשא',
    'בהעלותך',
    'שלח',
    'קרח',
    'חקת',
    'בלק',
    'פינחס',
    'מטות',
    'מסעי',
  ],
  דברים: [
    'דברים',
    'ואתחנן',
    'עקב',
    'ראה',
    'שופטים',
    'כי תצא',
    'כי תבוא',
    'נצבים',
    'וילך',
    'האזינו',
    'וזאת הברכה',
  ],
};

export const Aliot = [
  'ראשון',
  'שני',
  'שלישי',
  'רביעי',
  'חמישי',
  'שישי',
  'שביעי',
  'מפטיר',
];
